"""
Задание 2.

Пользователь вводит время в секундах.
Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
Используйте форматирование строк.

Пример:
Введите время в секундах: 3600
Время в формате ч:м:с - 1.0 : 60.0 : 3600
"""
second_time = int(input("Пожалуйста, введите время в секундах: "))
hour_time = second_time / 3600
minute_time = second_time / 60
print(f"Вами указанные секунды в часах будут:, {hour_time}, в минутах будут:, {minute_time}, и в секундах: {second_time}")